# #04: Pemilihan kolom (columns selection) pada Data Frame berdasarkan tipe data

## Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.0.3
1.24.3

## Persiapan Data Frame

In [5]:
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df

   bil_pecahan  bil_bulat
0          5.0          1
1         13.0          5
2         12.0         18
3          6.0          2
4         16.0          3

In [6]:
# df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df.index = pd.date_range(start='2023-10-01', periods=n_rows, freq='H')

df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2023-10-01 00:00:00          5.0          1    A
1 2023-10-01 01:00:00         13.0          5    B
2 2023-10-01 02:00:00         12.0         18    C
3 2023-10-01 03:00:00          6.0          2    D
4 2023-10-01 04:00:00         16.0          3    E

In [7]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

## Memilih kolom bertipe data numerik

In [9]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          5.0          1
1         13.0          5
2         12.0         18
3          6.0          2
4         16.0          3

In [10]:
df.select_dtypes(include='float')

   bil_pecahan
0          5.0
1         13.0
2         12.0
3          6.0
4         16.0

In [11]:
df.select_dtypes(include='int')

   bil_bulat
0          1
1          5
2         18
3          2
4          3

## Memilih kolom bertipe data string atau `object`

In [12]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

## Memilih kolom bertipe data `datetime`

In [14]:
df.select_dtypes(include='datetime')

                index
0 2023-10-01 00:00:00
1 2023-10-01 01:00:00
2 2023-10-01 02:00:00
3 2023-10-01 03:00:00
4 2023-10-01 04:00:00

## Memilih kolom dengan kombinasi tipe data

In [15]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          5.0          1    A
1         13.0          5    B
2         12.0         18    C
3          6.0          2    D
4         16.0          3    E